app/views/photos/index.html.haml

SELECT "photos".* FROM "photos"
---
      /this calls the data using javascript comment out the rest ans check it in the console
      /-#= content_tag "div", id: "photos", data: {url: Photo.limit(10) } do