app/controllers/home_controller.rb

  def index
  	@user = User.new
  	@messages = Message.all
    @photos = Photo.all
---
SELECT "messages".* FROM "messages"
SELECT  "photos".* FROM "photos" LIMIT 1

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", nil]]