app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
    #temporary search
    @photos = Photo.where(["title LIKE ?","%#{params[:search]}%"])
    #interfering with index if not registered or logged in. Check later and fix
    #It should allow you to search through
    @user = current_user.id
    @pic = Photo.where(:user_id => "#{current_user.id}")
---
SELECT  "photos".* FROM "photos" LIMIT 1
SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = ? LIMIT 1  [["user_id", 2]]

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "title", "price", "description", "keywords", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @photo.update(photo_params)
---
UPDATE "photos" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "photos"."id" = ?

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]

    def set_photo
      @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", nil]]